---
title: CopyMonitorFailures
classe: Autodesk.Revit.DB.BuiltInFailures+CopyMonitorFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# CopyMonitorFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId AlreadyCopiedAndStopWatch { get; }` | `CopyMonitorFailures.AlreadyCopiedAndStopWatch` | FailureDefinitionId |
| `FailureDefinitionId AlreadyWatched { get; }` | `CopyMonitorFailures.AlreadyWatched` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyCuttingInsert { get; }` | `CopyMonitorFailures.CannotCopyCuttingInsert` | FailureDefinitionId |
| `FailureDefinitionId CannotMoveHostedFixtureViaCopyMonitor { get; }` | `CopyMonitorFailures.CannotMoveHostedFixtureViaCopyMonitor` | FailureDefinitionId |
| `FailureDefinitionId CopyWatchAlert { get; }` | `CopyMonitorFailures.CopyWatchAlert` | FailureDefinitionId |
| `FailureDefinitionId GridDeletedSameName { get; }` | `CopyMonitorFailures.GridDeletedSameName` | FailureDefinitionId |
| `FailureDefinitionId LevelDeletedSameName { get; }` | `CopyMonitorFailures.LevelDeletedSameName` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```